# model_repository/sts-model/config.pbtxt
name: "sts-model"
platform: "onnxruntime_onnx"
max_batch_size: 8

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [ -1 ]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [ -1 ]
  }
]

output [
  {
    name: "similarity_score"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
